Revit 2027 API
FabricSheetType.SheetMass Property
 The sheet mass.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double SheetMass { get; set; }
Public Property SheetMass As Double
	Get
	Set
public:
property double SheetMass {
	double get ();
	void set (double value);
}
member SheetMass : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentException |  When setting this property: The given value for sheetMass is not a number
ArgumentOutOfRangeException |  When setting this property: The given value for sheetMass must be non-negative.
See Also
Reference
FabricSheetType Class
Autodesk.Revit.DB.Structure Namespace